_posts/programming/2023-07-04-cppcoreguidelines-cp41.html
---
layout: post
title: CppCoreGuidelines CP.41 减少线程的创建和销毁
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Minimize thread creation and destruction&rdquo;
</p>

<p>
理由
</p>

<p>
线程创建成本高。
</p>

<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold;">worker</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Message</span> <span style="color: #000000;">m</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// process</span>
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold;">dispatcher</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">istream</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">is</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Message</span> <span style="color: #000000;">m</span>; is <span style="color: #7F0055; font-weight: bold;">&gt;&gt;</span> m; <span style="color: #7388d6;">)</span>
        run_list.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">push_back</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">new</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">thread</span><span style="color: #909183;">(</span>worker, m<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
这段代码给每一个消息生成一个线程。任务完成后， <code>run_list</code> 会销毁线程。
</p>

<p>
其实我们可以用让一组创建好的工作线程来处理消息。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">Sync_queue</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Message</span><span style="color: #707183; font-weight: bold;">&gt;</span> <span style="color: #000000;">work</span>;

<span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold;">dispatcher</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">istream</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">is</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Message</span> <span style="color: #000000;">m</span>; is <span style="color: #7F0055; font-weight: bold;">&gt;&gt;</span> m; <span style="color: #7388d6;">)</span>
        work.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">put</span><span style="color: #7388d6;">(</span>m<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold;">worker</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Message</span> <span style="color: #000000;">m</span>; <span style="color: #000000;">m</span> <span style="color: #7F0055; font-weight: bold;">=</span> work.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">get</span><span style="color: #909183;">()</span>; <span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #3F7F5F;">// process</span>
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold;">workers</span><span style="color: #707183;">()</span>  <span style="color: #3F7F5F;">// set up worker threads (specifically 4 worker threads)</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">joining_thread</span> <span style="color: #000000;">w1</span> <span style="color: #7388d6;">{</span>worker<span style="color: #7388d6;">}</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">joining_thread</span> <span style="color: #000000;">w2</span> <span style="color: #7388d6;">{</span>worker<span style="color: #7388d6;">}</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">joining_thread</span> <span style="color: #000000;">w3</span> <span style="color: #7388d6;">{</span>worker<span style="color: #7388d6;">}</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">joining_thread</span> <span style="color: #000000;">w4</span> <span style="color: #7388d6;">{</span>worker<span style="color: #7388d6;">}</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
注意
</p>

<p>
如果你的系统有很好的线程池，尽量用起来。如果你的系统有很好的消息队列，尽量用起来。
</p>
